import streamlit as st

#ส่วนที่ 1 หัวข้อของเว็บ
st.markdown("# :red[คำนวนค่าดัชนีมวลกาย bmi]")
st.write("ใส่น้ำหนักและส่วนสูงของคุณเพื่อตรวจเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 ช่องรับข้อมูลน้ำหนักส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ(กิโลกรัม):",min_value = 1.00)
height_cm = st.number_input("กรอกส่วนสูงของคุณ(เซนติเมตร):",min_value = 1.00)

# ปุ่มกดคำนวนค่าbmi
if st.button("คำนวนค่าbmi"):
  # แปลงส่วนสูงจาก cm เป็น m แล้วหาค่า bmi
  height_m = height_cm / 100
  bmi = weight / (weight_m ** 2)

  st.write ("---")
  st.header (f"ค่า bmi ของคุณคือ : **{bmi : .2f}**")  

#แปลงค่าbmi
if bmi < 18.5:
   st.warning("คุณมีน้ำหนักน้อยกว่าเกณฑ์(ผอม)")
elif 18.5 <= bmi < 23.0:
   st.success("คุณมีน้ำหนักอยุ่ในเกณฑ์ที่ปกติ(สมส่วน)")
elif 23.0 <= bmi < 25.0:
   st.info("คุณเริ่มมีน้ำหนักเกินกว่าเกณฑ์(ท้วม)")
else bmi > 25.0:
   st.error("คุณอยู่ในเกณฑ์ที่อ้วน ควรระวังเรื่องสุขภาพและควรออกกำลังกาย")

st.divider()
st.write("นาย ดิฐธนา สุระธนาจิต ม.4/13 เลขที่25")
